Revit 2027 API
IFCAnyHandle.SetAttribute(String, IList<Double>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	IList<double> values
)
Public Sub SetAttribute (
	name As String,
	values As IList(Of Double)
)
public:
void SetAttribute(
	String^ name,
	IList<double>^ values
)
member SetAttribute :
        name : string *
        values : IList<float> -> unit
Parameters
name String
values IList<Double>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace